In [2]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 1. Work with unique value

In [5]:
df1 = pd.DataFrame({
    'A': ['Bình', 'Nhân', 'Tú', 'Thanh', 'Trần'], 
    'B': [123, 234, 234, 123, 555],
    'C': ['xyz', 'abc', 'def', 'def', 'ggg']
})
df1

       A    B    C
0   Bình  123  xyz
1   Nhân  234  abc
2     Tú  234  def
3  Thanh  123  def
4   Trần  555  ggg

In [8]:
df1['B'].unique()
df1['B'].nunique()
df1['B'].value_counts()

array([123, 234, 555], dtype=int64)

3

B
123    2
234    2
555    1
Name: count, dtype: int64

# 2. Apply function

In [11]:
def mul(x):
    return x*2
df1['B'].apply(mul)
df1['C'].apply(len)

0     246
1     468
2     468
3     246
4    1110
Name: B, dtype: int64

0    3
1    3
2    3
3    3
4    3
Name: C, dtype: int64

# 3. Get column and index

In [12]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [13]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
for i in df1.index:
    print(df1.iloc[i]['A'])

Bình
Nhân
Tú
Thanh
Trần

# 4. Sort

In [17]:
df1.sort_values('A')

       A    B    C
0   Bình  123  xyz
1   Nhân  234  abc
3  Thanh  123  def
4   Trần  555  ggg
2     Tú  234  def

# 5. Pivot table

In [19]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [22]:
df.pivot_table(values='Sales', index=['Company', 'Person'])

                 Sales
Company Person
FB      Carl     243.0
        Sarah    350.0
GOOG    Charlie  120.0
        Sam      200.0
MSFT    Amy      340.0
        Vanessa  124.0